hw1/app/views/professors/show.html.erb

  <ol>
  <% @professor.sections.each do |section| %>
---
SELECT "sections".* FROM "sections" WHERE "sections"."professor_id" = ?  [["professor_id", 1]]