hw1/app/views/courses/show.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."course_id" = ?  [["course_id", 3]]
---
  <ol>
  <% @course.sections.each do |section| %>