hw1/app/controllers/courses_controller.rb

INSERT INTO "courses" ("name", "semester", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "WebApp"], ["semester", "Fall"], ["created_at", "2017-09-13 22:58:03.103036"], ["updated_at", "2017-09-13 22:58:03.103036"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save