hw1/app/controllers/professors_controller.rb

  def index
    @professors = Professor.all
---
SELECT "professors".* FROM "professors"

  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save
---
INSERT INTO "professors" ("name", "office", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Justin"], ["office", "somewhere"], ["email", "ssfa@adsfa"], ["created_at", "2017-09-13 22:57:45.582864"], ["updated_at", "2017-09-13 22:57:45.582864"]]

  def destroy
    @professor.destroy
---
DELETE FROM "professors" WHERE "professors"."id" = ?  [["id", 1]]

    def set_professor
      @professor = Professor.find(params[:id])
---
SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]