hw1/app/controllers/sections_controller.rb

SELECT "professors".* FROM "professors"
SELECT "courses".* FROM "courses"
---
  def new
    @section = Section.new
    @professors = Professor.all
    @courses = Course.all

SELECT "professors".* FROM "professors"
SELECT "courses".* FROM "courses"
---
  def edit
    @professors = Professor.all
    @courses = Course.all

INSERT INTO "sections" ("section_number", "building", "room_number", "professor_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["section_number", 1], ["building", "AES"], ["room_number", 220], ["professor_id", 4], ["course_id", 3], ["created_at", "2017-09-14 02:01:14.013574"], ["updated_at", "2017-09-14 02:01:14.013574"]]
---
  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save

DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 1]]
---
  def destroy
    @section.destroy